sampleSetup_Smag_r180/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType LES;

LES
{
	LESModel	Smagorinsky;
	
	turbulence	on;

	printCoeffs	on;

	delta		cubeRootVol;

	dynamicKEqnCoeffs
	{
		filter		simple;
	}

	cubeRootVolCoeffs
	{
		deltaCoeff	1;
	}
	
	PrandtlCoeffs
	{
		delta	cubeRootVol;
		cubeRootVolCoeffs
		{
			deltaVoeff	1;
		}

		smoothCoeffs
		{
			delta		cubeRootVol;
			cubeRootVolCoeffs
			{
				deltaCoeff	1;
			}
			maxDeltaRatio		1.1;
		}

		vanDriestCoeffs
		{
			delta		cubeRootVol;
			cubeRootVolCoeffs
			{
				deltaCoeff	1;
			}
			smoothCoeffs
			{
				delta		cubeRootVol;
				cubeRootVolCoeffs
				{
					deltaCoeff	1;
				}
				maxDeltaRatio	1.1;
			}
			Aplus	26;
			Cdelta	0.158;
		}

		smoothCoeffs
		{
			delta		cubeRootVol;
			cubeRootVolCoeffs
			{
				deltaCoeff	1;
			}
			maxDeltaRatio		1.1;
		}
	}
	
	

// ************************************************************************* //
